---
kind: method
id: M:Autodesk.Revit.DB.Rectangle.#ctor(Autodesk.Revit.DB.Rectangle)
source: html/bdc9f8a5-6198-d3bb-0060-75f96b7a4261.htm
---
# Autodesk.Revit.DB.Rectangle.#ctor Method

Constructs a new copy of the input ScreenRectangle object.

## Syntax (C#)
```csharp
public Rectangle(
	Rectangle other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Rectangle`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null